import 'package:flutter/material.dart';

class PoemPage extends StatefulWidget {
  const PoemPage({Key? key}) : super(key: key);

  @override
  State<PoemPage> createState() => _PoemPageState();
}

class _PoemPageState extends State<PoemPage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Padding(
        padding: const EdgeInsets.symmetric(horizontal: 15),
        child: ListView(children: [
          SizedBox(height: 60,),
          Text("Poem Name",style: TextStyle(fontSize: 21,color: Colors.teal),),
          SizedBox(height: 10,),
          Text("by Writer Name",style: TextStyle(fontSize: 21),),
          SizedBox(height: 10,),
          Text('''
          কথাটা ত মিছা লয়
          লালগড়ের জঙ্গলমহলের সবাই জানে
          ডুমুরগড়্যা, বেণাচাপড়া, বাঁকিশোল,
          হাতিঘোসা,শালডাঙ্গা
          মোহনপুর, কলাইমুড়ির জানে সবাই
          দিনের বেলা পুলিশ
          রাতের বেলা উয়ারা,
          পুলিশ বলে স্বাধীনতা
          উয়ারা বলে মিছাকথা
          ফের পুলিশ বলে স্বাধীনতা
          ফের উয়ারা বলে মিছা কথা,
          আমরা গরীব মানুষ
          আমরা গো মুখখু মানুষ
          খিদা বুঝি তিলষা বুঝি
          ইসবের ত কিছু বুঝি নাই,
          তবু দিনের বেলা পুলিশ আসে,
          “হপন আছিস?”
          হঁ আইজ্ঞা আছি
          আমি হপন মান্ডি
          বাপ তিলকা মান্ডি।
          রাতের বেলা জঙ্গলমহলে রাত নামলে
          আমার তালপাতায় ছাওয়া মাটির ঘরে
          জুমড়াকাঠের আংরার পারা অন্ধকার
          কপাট ও নাই হুড়কাও নাই
          তখন উয়ারা আসে
          কমরেড হপন আছো?
          বলি হঁ আইজ্ঞা আছি
          আমি হপন মান্ডি
          বাপ তিলকা মান্ডি।

          এমনি করে দিন কাটে
          এমনি করে রাত কাটে
          ইয়ার মাঝে গেলবছরে
          বাঁকিশোলের কালভাট গেল বোমা তে উড়ে
          তখন আমি খাটতে গেছি খড়গপুরের মুরগি
          দিনটা ছিল বাবুদে পতকা তুলার দিন
          আমরা হাভাতা মানুষ
          আমরা গো মুখখু মানুষ
          খিদা বুঝি তিলষা বুঝি
          পতকা ত বুঝি নাই
          তাই ভাল্যে ভাল্যে দেখছিলম
          কিরম তিরঙ্গা পতকা তুলছে বাবুরা
          খড়গপুরের টাউনের বাবু
          দেখতে দেখতে পুলিশ গাড়ি,
          পুলিশ বললেক, তোর নাম কি?
          বললম, হপন মান্ডি
          বাপ তিলকা মান্ডি।
          গাঁ?
          বেণাচাপড়া।
          বলক?
          লালগড় জঙ্গলমহল।
          বললেক, আর বলতে হবেক নাই চল চল।
          বলি যাব অ কুথাকে?
          বললেক,লক আপে।
          সেটা কী বঠে আইজ্ঞা?
          সে তুই বুঝে যাবি থানাতে গেলেই বুঝে যাবি।
          ''',style: TextStyle(fontSize: 18),),

        ],),
      ),
    );
  }
}
